src/tr069/templates/tr069_inform_req_template.xml

<soapenv:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:cwmp="urn:dslforum-org:cwmp-1-0" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Header>
      <cwmp:ID soapenv:mustUnderstand="1">{TR069CPEReqIDDP}</cwmp:ID>
  </soapenv:Header>
  <soapenv:Body>
    <cwmp:Inform>
      <DeviceId xmlns="urn:dslforum-org:cwmp-1-0">
        {TR069DeviceInfoDP}
      </DeviceId>
      <cwmp:Event soap:arrayType="cwmp:EventStruct[{TR069NumEventsDP}]">
         {TR069IEStructDP}
      </cwmp:Event>
      <MaxEnvelopes>1</MaxEnvelopes>
      <CurrentTime>{TR069CurrentTimeDTP}</CurrentTime>
      <RetryCount>0</RetryCount>
      <ParameterList soap:arrayType="cwmp:ParameterValueStruct[{TR069NumIPVDP}]">
        {TR069IPVStructDP}
      </ParameterList>
    </cwmp:Inform>
  </soapenv:Body>
</soapenv:Envelope>
